simulation/OpenFOAM/LV3_LD-Haack/rcf_100/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    freestream
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    nose
    {
        type            zeroGradient;
    }
    
    wedgefront
    {
        type            wedge;
    }
    
    wedgeback
    {
        type            wedge;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
