simulation/OpenFOAM/LV3_LD-Haack/rcf_100/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	//surface of nose, front side
	(0 0 0)					//0	nose tip
	(0.8382 0.08376894 0.002925276)		//1	nose outlet front
	
	//front bounds
	(0.8382 0.3350758 0.0117011)			//2
	(0 0.3350758 0.0117011)			//3
	(-0.16764 0.3350758 0.0117011)		//4
	(-0.16764 0 0)				//5
	
	//back nose surface
	//0
	(0.8382 0.08376894 -0.002925276)		//6	nose outlet back
	
	//back bounds
	(0.8382 0.3350758 -0.0117011)			//7
	(0 0.3350758 -0.0117011)			//8
	(-0.16764 0.3350758 -0.0117011)		//9
	//5
	//and close off to point 0
);

blocks
(
    //hex (0 1 2 3  0 6 7 8) (33 13 1) simpleGrading (1.5 1.5 1)//nose block
    //hex (5 0 3 4  5 0 8 9) (7 13 1) simpleGrading (0.66 1.5 1)//inlet block
    
    hex (0 6 7 8  0 1 2 3) (100 39 1) simpleGrading (5 5 1)//nose block
    hex (5 0 8 9  5 0 3 4) (21 39 1) simpleGrading (0.2 5 1)//inlet block
    
    //wedge (0 8 3	6 7 2 1) (13 33 1) simpleGrading (1.5 1.5 1)//nose
    //prism (5 9 4	0 8 3)   (13 7 1) simpleGrading (1.5 0.66 1)//inlet
);

edges
(
	spline 0 1//nose surface front
	(
		(0.02768829 0.008414787 0.0002938509)
		(0.1177451 0.0244963 0.0008554298)
		(0.207802 0.0368207 0.001285807)
		(0.2978589 0.04727083 0.001650734)
		(0.3879157 0.05636064 0.001968157)
		(0.4779726 0.06429687 0.002245296)
		(0.5680294 0.07114792 0.00248454)
		(0.6580863 0.07687858 0.002684659)
		(0.7481431 0.08131109 0.002839446)
	)
	(0 0 0)//presumably the end vectors
	(0 0 0)
	
	spline 0 6//nose surface back
	(
		(0.02768829 0.008414787 -0.0002938509)
		(0.1177451 0.0244963 -0.0008554298)
		(0.207802 0.0368207 -0.001285807)
		(0.2978589 0.04727083 -0.001650734)
		(0.3879157 0.05636064 -0.001968157)
		(0.4779726 0.06429687 -0.002245296)
		(0.5680294 0.07114792 -0.00248454)
		(0.6580863 0.07687858 -0.002684659)
		(0.7481431 0.08131109 -0.002839446)
	)
	(0 0 0)
	(0 0 0)
	
	arc 1 6 (0.8382 0.08382 0)//outlet cone edge
	
	arc 2 7 (0.8382 0.33528 0)//outlet far edge
	
	arc 3 8 (0 0.33528 0)//middle far edge
	
	arc 4 9 (-0.16764 0.33528 0)//inlet far edge
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(5 4 9 5)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(1 2 7 6)
		);
	}
	freestream
	{
		type patch;
		faces
		(
			(4 3 8 9)
			(3 2 7 8)
		);
	}
	nose
	{
		type wall;
		faces
		(
			(0 1 6 0)
		);
	}
	wedgefront
	{
		type wedge;
		faces
		(
			(0 3 4 5)
			(0 1 2 3)
		);
	}
	wedgeback
	{
		type wedge;
		faces
		(
			(0 8 9 5)
			(0 6 7 8)
		);
	}
);


mergePatchPairs
(
);

// ************************************************************************* //
